{
  "fetched_at": "2025-12-09T18:04:59.710205+00:00",
  "feeds": [
    {
      "id": "therecord",
      "source": "The Record from Recorded Future News",
      "url": "https://therecord.media/feed/",
      "items": [
        {
          "title": "Khashoggi widow files complaint in France alleging Saudi government infected devices with spyware",
          "link": "https://therecord.media/khashoggi-widow-legal-complaint-filed-alleging-saudi-government-spyware",
          "published": "Tue, 09 Dec 2025 16:44:48 GMT",
          "summary": "A French judge will determine whether investigators should proceed with a complaint from the widow of slain writer Jamal Khashoggi alleging that Saudi Arabia deployed spyware on her devices before his killing."
        },
        {
          "title": "Seoul cyber investigators seize data, devices from ‘South Korea’s Amazon’ following data breach",
          "link": "https://therecord.media/seoul-cyber-investigators-seize-data-korea-tech-giant",
          "published": "Tue, 09 Dec 2025 14:51:43 GMT",
          "summary": "Cyber investigators from the Seoul Metropolitan Police Agency seized devices and data from one of the country's largest tech firms to find evidence uncovering how the breach took place."
        },
        {
          "title": "Trump plans executive order curbing state AI laws",
          "link": "https://therecord.media/trump-plans-ai-exec-order-curbing-state-laws",
          "published": "Mon, 08 Dec 2025 21:25:47 GMT",
          "summary": "Legislators at both the state and federal level have increasingly scrutinized how AI models suck up data for training purposes."
        },
        {
          "title": "More than $2 billion in payments from 4,000 ransomware incidents reported to Treasury in recent years",
          "link": "https://therecord.media/fincen-treasury-2-billion-ransomware-payments-report",
          "published": "Mon, 08 Dec 2025 21:15:53 GMT",
          "summary": "The Financial Crimes Enforcement Network (FinCEN) released a study covering 4,194 ransomware incidents that were reported through the Bank Secrecy Act over the three-year period."
        },
        {
          "title": "Meta proposal for less data sharing is approved by European Commission",
          "link": "https://therecord.media/meta-less-data-sharing-european-commission",
          "published": "Mon, 08 Dec 2025 20:01:45 GMT",
          "summary": "Instagram and Facebook users in the EU will now have the option to share less personal data and see fewer personalized ads."
        },
        {
          "title": "Russian kids revolt as Kremlin bans Roblox, other popular apps",
          "link": "https://therecord.media/russia-bans-roblox-drawing-criticism-from-kids",
          "published": "Mon, 08 Dec 2025 17:02:22 GMT",
          "summary": "The ban on Roblox has drawn a sharp backlash from the platform’s roughly 18 million monthly Russian users — mostly children and teenagers — who have launched social-media campaigns and video petitions urging officials to restore access."
        },
        {
          "title": "Researchers track dozens of organizations affected by React2Shell compromises tied to China’s MSS",
          "link": "https://therecord.media/researchers-track-dozens-react2shell-vuln",
          "published": "Mon, 08 Dec 2025 16:30:12 GMT",
          "summary": "Researchers have confirmed more than 30 affected organizations tied to the React2Shell bug that emerged last week."
        }
      ]
    }
  ]
}