{
  "fetched_at": "2025-12-08T18:06:09.638109+00:00",
  "feeds": [
    {
      "id": "therecord",
      "source": "The Record from Recorded Future News",
      "url": "https://therecord.media/feed/",
      "items": [
        {
          "title": "Russian kids revolt as Kremlin bans Roblox, other popular apps",
          "link": "https://therecord.media/russia-bans-roblox-drawing-criticism-from-kids",
          "published": "Mon, 08 Dec 2025 17:02:22 GMT",
          "summary": "The ban on Roblox has drawn a sharp backlash from the platform’s roughly 18 million monthly Russian users — mostly children and teenagers — who have launched social-media campaigns and video petitions urging officials to restore access."
        },
        {
          "title": "Researchers track dozens of organizations affected by React2Shell compromises tied to China’s MSS",
          "link": "https://therecord.media/researchers-track-dozens-react2shell-vuln",
          "published": "Mon, 08 Dec 2025 16:30:12 GMT",
          "summary": "Researchers have confirmed more than 30 affected organizations tied to the React2Shell bug that emerged last week."
        },
        {
          "title": "Three hacking groups, two vulnerabilities and all eyes on China",
          "link": "https://therecord.media/three-hacking-groups-two-vulnerabilities-china-microsoft",
          "published": "Mon, 08 Dec 2025 14:51:22 GMT",
          "summary": "What does it mean that three separate China-linked groups all moved on the same SharePoint vulnerabilities at nearly the same time?"
        },
        {
          "title": "Russian police bust bank-account hacking gang that used NFCGate-based malware",
          "link": "https://therecord.media/russian-police-bust-banking-hackers-nfcgate-based-malware",
          "published": "Mon, 08 Dec 2025 13:56:16 GMT",
          "summary": "Russian police said they took down a multimillion-dollar cybercrime operation that used malware based on a legitimate software tool to take over individuals' bank accounts."
        },
        {
          "title": "UK intelligence warns AI 'prompt injection' attacks might never go away",
          "link": "https://therecord.media/prompt-injection-attacks-uk-intelligence-warning",
          "published": "Mon, 08 Dec 2025 13:06:07 GMT",
          "summary": "A top technologist at the U.K.’s National Cyber Security Centre said “there’s a good chance” that prompt injection attacks against AI will never be eliminated, and he warned of the related risks of embedding generative AI into digital systems globally."
        }
      ]
    }
  ]
}