{
  "fetched_at": "2025-12-10T18:06:15.089091+00:00",
  "feeds": [
    {
      "id": "therecord",
      "source": "The Record from Recorded Future News",
      "url": "https://therecord.media/feed/",
      "items": [
        {
          "title": "US extradites member of Russian hacktivist group involved in critical infrastructure attacks",
          "link": "https://therecord.media/us-extradites-member-of-russian-hacking-groups-critical-infrastructure",
          "published": "Wed, 10 Dec 2025 17:49:32 GMT",
          "summary": "The Justice Department unveiled two indictments on Tuesday evening charging Victoria Eduardovna Dubranova for her role in CyberArmyofRussia_Reborn (CARR) and NoName057(16), two groups known for attacking critical infrastructure."
        },
        {
          "title": "Teen who allegedly stole millions of personal data records arrested in Spain",
          "link": "https://therecord.media/spain-arrests-teen-suspect-data-theft-and-sale",
          "published": "Wed, 10 Dec 2025 15:26:32 GMT",
          "summary": "Spanish police accused a 19-year-old man of stealing 64 million personal data records from multiple companies and attempting to sell them on hacker forums."
        },
        {
          "title": "Russia’s flagship airline hacked through little-known tech vendor, according to new report",
          "link": "https://therecord.media/russia-flagship-airline-hacked-through-little-known-vendor",
          "published": "Wed, 10 Dec 2025 15:13:28 GMT",
          "summary": "The breach, which was claimed by the pro-Ukrainian hacker collective Silent Crow and the allied Belarusian Cyber-Partisans, paralyzed Aeroflot’s operations, grounding more than a hundred flights."
        },
        {
          "title": "Senators return to effort to boost cybersecurity for commercial satellite industry",
          "link": "https://therecord.media/commercial-satellite-industry-cybersecurity-cornyn-peters-bill-returns",
          "published": "Wed, 10 Dec 2025 13:53:50 GMT",
          "summary": "Sens. John Cornyn and Gary Peters are taking another crack at moving legislation meant to help commercial satellite providers defend their networks."
        },
        {
          "title": "British government sanctions Russian and Chinese groups over information warfare",
          "link": "https://therecord.media/uk-sanctions-russia-china-entities-information-warfare",
          "published": "Wed, 10 Dec 2025 12:54:16 GMT",
          "summary": "The U.K.'s foreign secretary announced sanctions on seven Russian individuals and influence networks, as well as the Chinese companies i-Soon and Integrity Technology Group."
        },
        {
          "title": "California man pleads guilty to RICO charges as DOJ indicts crypto theft gang",
          "link": "https://therecord.media/california-man-pleads-guilty-rico-charges-crypto-theft",
          "published": "Tue, 09 Dec 2025 21:44:32 GMT",
          "summary": "Evan Tangeman became the ninth person to plead guilty as part of a wider Justice Department takedown of a criminal group known as the Social Engineering Enterprise."
        },
        {
          "title": "Khashoggi widow files complaint in France alleging Saudi government infected devices with spyware",
          "link": "https://therecord.media/khashoggi-widow-legal-complaint-filed-alleging-saudi-government-spyware",
          "published": "Tue, 09 Dec 2025 16:44:48 GMT",
          "summary": "A French judge will determine whether investigators should proceed with a complaint from the widow of slain writer Jamal Khashoggi alleging that Saudi Arabia deployed spyware on her devices before his killing."
        },
        {
          "title": "Seoul cyber investigators seize data, devices from ‘South Korea’s Amazon’ following data breach",
          "link": "https://therecord.media/seoul-cyber-investigators-seize-data-korea-tech-giant",
          "published": "Tue, 09 Dec 2025 14:51:43 GMT",
          "summary": "Cyber investigators from the Seoul Metropolitan Police Agency seized devices and data from one of the country's largest tech firms to find evidence uncovering how the breach took place."
        },
        {
          "title": "Trump plans executive order curbing state AI laws",
          "link": "https://therecord.media/trump-plans-ai-exec-order-curbing-state-laws",
          "published": "Mon, 08 Dec 2025 21:25:47 GMT",
          "summary": "Legislators at both the state and federal level have increasingly scrutinized how AI models suck up data for training purposes."
        }
      ]
    }
  ]
}