{
  "fetched_at": "2025-12-07T06:05:16.665267+00:00",
  "feeds": [
    {
      "id": "cisa-gov",
      "source": "All CISA Advisories",
      "url": "https://www.cisa.gov/cybersecurity-advisories/all.xml",
      "items": [
        {
          "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
          "link": "https://www.cisa.gov/news-events/alerts/2025/12/05/cisa-adds-one-known-exploited-vulnerability-catalog",
          "published": "Fri, 05 Dec 25 12:00:00 +0000",
          "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog, based on evidence of active exploitation. CVE-2025-55182 Meta React Server Components Remote Code Execution Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living li"
        },
        {
          "title": "Johnson Controls OpenBlue Mobile Web Application for OpenBlue Workplace",
          "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-338-03",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 6.5 ATTENTION: Exploitable remotely/low attack complexity Vendor: Johnson Controls Inc. Equipment: OpenBlue Mobile Web Application for OpenBlue Workplace Vulnerability: Direct Request ('Forced Browsing') 2. RISK EVALUATION Successful exploitation of this vulnerability could allow an attacker to gain unauthorized access to sensitive information. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Johnson Controls OpenBlue Mobile Web Applicat"
        },
        {
          "title": "BRICKSTORM Backdoor",
          "link": "https://www.cisa.gov/news-events/analysis-reports/ar25-338a",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "Malware Analysis at a Glance Executive Summary The Cybersecurity and Infrastructure Security Agency (CISA), National Security Agency (NSA), and Canadian Centre for Cyber Security (Cyber Centre) assess People’s Republic of China (PRC) state-sponsored cyber actors are using BRICKSTORM malware for long-term persistence on victim systems. CISA, NSA, and Cyber Centre are releasing this Malware Analysis Report to share indicators of compromise (IOCs) and detection signatures based off analysis of eigh"
        },
        {
          "title": "SolisCloud Monitoring Platform",
          "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-338-06",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: SolisCloud Equipment: Monitoring Platform (Cloud API & Device Control API) Vulnerability: Authorization Bypass Through User-Controlled Key 2. RISK EVALUATION Successful exploitation of this vulnerability could allow an attacker to access sensitive information by manipulating API requests. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of SolisCloud Monitoring Platform are a"
        },
        {
          "title": "Advantech iView",
          "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-338-07",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Advantech Equipment: iView Vulnerability: SQL Injection 2. RISK EVALUATION Successful exploitation of this vulnerability could allow an attacker to disclose sensitive information, modify, or delete data. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Advantech products are affected: iView: 5.7.05.7057 3.2 VULNERABILITY OVERVIEW 3.2.1 Improper Neutralization of Special Elements used "
        },
        {
          "title": "Johnson Controls iSTAR",
          "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-338-04",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 7.1 ATTENTION: Low attack complexity Vendor: Johnson Controls Inc. Equipment: iSTAR eX, iSTAR Edge, iSTAR Ultra LT, iSTAR Ultra, iSTAR Ultra SE Vulnerability: Improper Validation of Certificate Expiration 2. RISK EVALUATION Successful exploitation of this vulnerability could result in the product failing to re-establish communication once the certificate expires. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Johnson Controls iSTAR are"
        },
        {
          "title": "Sunbird DCIM dcTrack and Power IQ",
          "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-338-05",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.4 ATTENTION: Exploitable remotely/low attack complexity Vendor: Sunbird Equipment: DCIM dcTrack, Power IQ Vulnerabilities: Authentication Bypass Using an Alternate Path or Channel, Use of Hard-coded Credentials 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow an attacker to gain unauthorized access or steal credentials. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Sunbird products are affected: DCIM dcTrack: Vers"
        },
        {
          "title": "CISA Releases Nine Industrial Control Systems Advisories",
          "link": "https://www.cisa.gov/news-events/alerts/2025/12/04/cisa-releases-nine-industrial-control-systems-advisories",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "CISA released nine Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-338-01 Mitsubishi Electric GX Works2 ICSA-25-338-02 MAXHUB Pivot ICSA-25-338-03 Johnson Controls OpenBlue Mobile Web Application for OpenBlue Workplace ICSA-25-338-04 Johnson Controls iSTAR ICSA-25-338-05 Sunbird DCIM dcTrack and Power IQ ICSA-25-338-06 SolisCloud Monitoring Platform ICSA-25-338-07 Advant"
        },
        {
          "title": "MAXHUB Pivot",
          "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-338-02",
          "published": "Thu, 04 Dec 25 12:00:00 +0000",
          "summary": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: MAXHUB Equipment: MAXHUB Pivot Vulnerability: Weak Password Recovery Mechanism for Forgotten Password 2. RISK EVALUATION Successful exploitation of this vulnerability could allow an attacker to request a password reset and gain unauthorized access to the account. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS MAXHUB reports the following versions of MAXHUB Pivot are affected: Pivot client applica"
        }
      ]
    },
    {
      "id": "cyberwire",
      "source": "The CyberWire",
      "url": "https://www.thecyberwire.com/feeds/rss.xml",
      "items": [
        {
          "title": "Daily Briefing: Cybersecurity threats and defense strategies",
          "link": "https://www.thecyberwire.com/newsletters/daily-briefing/13/1",
          "published": "Sat, 07 Dec 2025 12:00:00 +0000",
          "summary": "Today's edition covers emerging cybersecurity threats, nation-state activities, ransomware trends, and the latest security advisories. Key topics include critical vulnerabilities in enterprise software, ongoing disinformation campaigns, and defense strategies for organizations. Industry experts weigh in on the evolving threat landscape and best practices for maintaining robust security postures in an increasingly connected world."
        },
        {
          "title": "Research Saturday: Advanced persistent threat analysis",
          "link": "https://www.thecyberwire.com/podcasts/research-saturday/312/notes",
          "published": "Fri, 06 Dec 2025 10:00:00 +0000",
          "summary": "This week's research deep-dive examines sophisticated attack methodologies employed by state-sponsored actors. Security researchers discuss attribution challenges, infrastructure analysis, and defensive countermeasures. The episode features detailed technical breakdowns of recent campaigns and provides actionable intelligence for security teams."
        },
        {
          "title": "Cybersecurity news roundup: Week in review",
          "link": "https://www.thecyberwire.com/newsletters/weekly-roundup/52/1",
          "published": "Thu, 05 Dec 2025 18:00:00 +0000",
          "summary": "A comprehensive summary of this week's most significant cybersecurity developments. Coverage includes major data breaches, regulatory updates, threat actor activity, security patches, and industry analysis. The roundup aggregates insights from across the security community to help professionals stay informed about the rapidly evolving cyber landscape."
        },
        {
          "title": "Hacking Humans: Social engineering tactics exposed",
          "link": "https://www.thecyberwire.com/podcasts/hacking-humans/285/notes",
          "published": "Wed, 04 Dec 2025 16:30:00 +0000",
          "summary": "An exploration of current social engineering techniques targeting organizations and individuals. This episode discusses phishing campaigns, business email compromise schemes, and psychological manipulation tactics. Security awareness experts provide guidance on identifying and mitigating these human-centric attacks."
        },
        {
          "title": "Daily Briefing: Zero-day vulnerabilities and patch priorities",
          "link": "https://www.thecyberwire.com/newsletters/daily-briefing/13/2",
          "published": "Tue, 03 Dec 2025 12:00:00 +0000",
          "summary": "Critical security updates and newly discovered vulnerabilities dominate today's briefing. Security teams are advised to prioritize patching efforts for actively exploited flaws affecting enterprise infrastructure. The briefing includes exploit timelines, vendor responses, and risk assessments to help organizations make informed decisions about their security posture."
        },
        {
          "title": "CyberWire Pro: Threat intelligence briefing",
          "link": "https://www.thecyberwire.com/pro/briefing/2025/12/02",
          "published": "Mon, 02 Dec 2025 09:00:00 +0000",
          "summary": "An executive-level briefing on current cyber threats impacting critical infrastructure and enterprise operations. This report synthesizes intelligence from multiple sources to provide strategic insights into adversary capabilities, tactics, and targets. Leaders receive actionable recommendations for enhancing organizational resilience."
        },
        {
          "title": "Caveat: Policy and legal implications of cyber operations",
          "link": "https://www.thecyberwire.com/podcasts/caveat/198/notes",
          "published": "Sun, 01 Dec 2025 14:00:00 +0000",
          "summary": "A discussion of the legal and policy dimensions surrounding cybersecurity and cyber warfare. Topics include international law, attribution challenges, proportionality in cyber responses, and emerging regulatory frameworks. Legal experts and policy analysts provide context for understanding the evolving rules of engagement in cyberspace."
        },
        {
          "title": "Daily Briefing: Ransomware operations and mitigation",
          "link": "https://www.thecyberwire.com/newsletters/daily-briefing/13/3",
          "published": "Sat, 30 Nov 2025 12:00:00 +0000",
          "summary": "Analysis of recent ransomware campaigns affecting healthcare, education, and government sectors. Security researchers detail attack vectors, encryption methods, and recovery options. The briefing emphasizes the importance of backup strategies, incident response planning, and cross-sector information sharing to combat the ransomware epidemic."
        },
        {
          "title": "Industry voices: CISO perspectives on emerging challenges",
          "link": "https://www.thecyberwire.com/stories/industry-voices-202511",
          "published": "Fri, 29 Nov 2025 16:00:00 +0000",
          "summary": "Leading Chief Information Security Officers share their insights on navigating today's complex threat environment. Discussions cover workforce challenges, budget constraints, board-level communication, and strategic planning. CISOs from various industries offer practical advice for peers facing similar challenges in protecting their organizations."
        }
      ]
    }
  ]
}